AXKuhta/stm32_ad9910/uart_cli.c
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

#include "stm32f7xx_hal.h"

#include "isr.h"
#include "performance.h"
#include "ad9910.h"
#include "units.h"
#include "timer.h"
#include "timer/emulator.h"
#include "sequencer.h"
#include "algos.h"
#include "vec.h"

extern uint32_t ad_system_clock;
extern uint16_t ad_default_asf;
extern uint8_t ad_default_fsc;

#define ABS(x) (x < 0 ? -x : x)

// Подготовка кодов для регистров CCMR
// TODO: вынести в другое место
#define DR_CTL	  0b00000001
#define DRHOLD    0b00000010
#define TXE       0b00000100
#define OSK       0b00001000
#define P_0       0b00010000
#define P_1       0b00100000
#define P_2       0b01000000
#define IO_UPDATE 0b10000000

#define PROFILE0  (0)
#define PROFILE1  (P_0)
#define PROFILE2  (P_1)
#define PROFILE3  (P_1 | P_0)
#define PROFILE4  (P_2)
#define PROFILE5  (P_2 | P_0)
#define PROFILE6  (P_2 | P_1)
#define PROFILE7  (P_2 | P_1 | P_0)

typedef struct logic_t {
	uint32_t hold_ns;
	uint8_t state;
} logic_t;

// Терминатор должен быть именно такой
// Первый элемент - парковочный профиль
// Второй элемент - оттянуть момент NDTR == 0 до конца излучения
// Третий элемент - терминатор
#define TERMINATOR 	{ .hold_ns = 1*1000, .state = 0 }, \
					{ .hold_ns = 1*1000, .state = 0 }, \
					{ 0, 0 }

// Спуск последовательности состояний в машинные коды
// Выделит и вернёт три массива для DMA
//
// Пример использования:
//
// ```
// seq_entry_t pulse = {
//     .logic_level_sequence = lower_logic_sequence((logic_t[]){
//         { .hold_ns = 900*1000, .state = P_0 }, // Излучение
//         TERMINATOR // Парковка + терминатор
//     })
// };
// ```
static logic_level_sequence_t lower_logic_sequence(logic_t states[]) {
	uint32_t timer_mhz = HAL_RCC_GetSysClockFreq() / 1000 / 1000;
	int slots_used = 0;

	// Проход 1: определить необходимый запас слотов времени
	// Триалим количество разбивок
	for (size_t i = 0; states[i].hold_ns; i++) {
		uint32_t timer_mu = states[i].hold_ns * timer_mhz / 1000;

		// Не можем точно представить время?
		// TODO: сообщение об ошибке
		assert(states[i].hold_ns * timer_mhz % 1000 == 0);

		int slots = 1;

		while (timer_mu / slots > 0xFFFF || timer_mu % slots) {
			slots++;

			// TODO: сообщение об ошибке
			assert(slots < 100);
		}

		slots_used += slots;
	}

	// TODO: использовать uint16_t - верхние биты бесполезны
	uint32_t* slave_a_stream = malloc(2 * sizeof(uint32_t) * slots_used);
	uint32_t* slave_b_stream = malloc(2 * sizeof(uint32_t) * slots_used);
	uint16_t* hold_time = malloc(sizeof(uint16_t) * slots_used);

	// см. "Output compare 1 mode"
	// https://www.st.com/resource/en/reference_manual/rm0385-stm32f75xxx-and-stm32f74xxx-advanced-armbased-32bit-mcus-stmicroelectronics.pdf
	const uint8_t set_hi = 0b00010000;
	const uint8_t set_lo = 0b00100000;

	// Проход 2: делаем машинные коды
	for (size_t i = 0, j = 0; states[i].hold_ns; i++) {
		uint8_t state = states[i].state;

		uint8_t a1 = state & DR_CTL ? set_hi : set_lo;		// PC6
		uint8_t a2 = state & DRHOLD ? set_hi : set_lo;		// PC7
		uint8_t a3 = state & TXE    ? set_hi : set_lo;		// PC8
		uint8_t a4 = state & OSK    ? set_hi : set_lo;		// PC9
		uint8_t b1 = state & P_1    ? set_hi : set_lo;		// PD12
		uint8_t b2 = state & P_0    ? set_hi : set_lo;		// PD13
		uint8_t b3 = state & P_2    ? set_hi : set_lo;		// PD14
		uint8_t b4 = state & IO_UPDATE ? set_hi : set_lo;	// PD15

		// Заново найти количество разбивок
		uint32_t timer_mu = states[i].hold_ns * timer_mhz / 1000;

		int slots = 1;

		while (timer_mu / slots > 0xFFFF || timer_mu % slots) {
			slots++;
		}

		// Размножить
		for (int k = 0; k < slots; k++) {
			slave_a_stream[2*j + 0] = (a2 << 8) + a1;
			slave_a_stream[2*j + 1] = (a4 << 8) + a3;

			slave_b_stream[2*j + 0] = (b2 << 8) + b1;
			slave_b_stream[2*j + 1] = (b4 << 8) + b3;

			hold_time[j] = timer_mu / slots;

			j++;
		}
	}

	return (logic_level_sequence_t) {
		.slave_a_stream = (void*)slave_a_stream,
		.slave_b_stream = (void*)slave_b_stream,
		.hold_time = hold_time,
		.count = slots_used
	};
}

// =============================================================================
// CLI COMMANDS
// =============================================================================

// 10^(-.4 dBm/10)		matches PR100 (158 MHz tone)
// #define OUTPUT_RATIO_CAL 0.9120108394

// 10^(-.2 dBm/10)		should match G4-218 (158 MHz tone)
#define OUTPUT_RATIO_CAL 0.954992586

void set_level_cmd(const char* str) {
	char unit[4] = {0};
	double voltage;

	int rc = sscanf(str, "%*s %lf %3s", &voltage, unit);

	if (rc != 2) {
		printf("Invalid arguments\n");
		printf("Usage: set_level voltage unit\n");
		printf("Example: set_level 200 mV\n");
		return;
	}

	double voltage_vrms = parse_volts(voltage, unit);

	if (voltage_vrms == 0) {
		return;
	}

	uint16_t asf;
	uint8_t fsc;

	int success = best_asf_fsc(voltage_vrms / OUTPUT_RATIO_CAL, &asf, &fsc);

	if (!success) {
		printf("Unable; try a voltage below 300 mV\n");
		return;
	}

	if (asf < 2) {
		printf("Unable; try a voltage above 10 uV\n");
		return;
	}

	double backconv_voltage = ad_voltage_vrms_from_asf_fsc(asf, fsc) * OUTPUT_RATIO_CAL;

	// Assume 50 ohms load
	double watts = backconv_voltage * backconv_voltage / 50.0;
	double dbm = 10.0*log10(watts / .001);

	char* verif_voltage = volts_unit( backconv_voltage );

	ad_default_asf = asf;
	ad_default_fsc = fsc;

	printf("Set ASF=%u FSC=%u which is %s rms or %.1lf dBm\n", asf, fsc, verif_voltage, dbm);

	free(verif_voltage);
}

void dbg_level_cmd(const char* str) {
	uint16_t asf;
	uint8_t fsc;

	int rc = sscanf(str, "%*s %hu %hhu", &asf, &fsc);

	if (rc != 2) {
		printf("Invalid arguments\n");
		printf("Usage: dbg_level asf fsc\n");
		printf("Example: dbg_level 16383 127\n");
		return;
	}

	double backconv_voltage = ad_voltage_vrms_from_asf_fsc(asf, fsc) * OUTPUT_RATIO_CAL;

	// Assume 50 ohms load
	double watts = backconv_voltage * backconv_voltage / 50.0;
	double dbm = 10.0*log10(watts / .001);

