AXKuhta/stm32_ad9910/uart_cli.c
	char* verif_voltage = volts_unit( backconv_voltage );

	printf("Set ASF=%u FSC=%u which is %s rms or %.1lf dBm\n", asf, fsc, verif_voltage, dbm);

	ad_default_asf = asf;
	ad_default_fsc = fsc;

	free(verif_voltage);
}

void test_tone_cmd(const char* str) {
	char unit[4] = {0};
	double freq;

	int rc = sscanf(str, "%*s %lf %3s", &freq, unit);

	if (rc != 2) {
		printf("Invalid arguments\n");
		printf("Usage: test_tone freq unit\n");
		printf("Example: test_tone 150 MHz\n");
		return;
	}

	uint32_t freq_hz = parse_freq(freq, unit);

	if (freq_hz == 0) {
		return;
	}

	char* verif_freq = freq_unit(freq_hz);

	printf("Test tone at %s\n", verif_freq);

	free(verif_freq);

	enter_test_tone_mode(freq_hz);
}

void basic_pulse_cmd(const char* str) {
	char o_unit[4] = {0};
	char d_unit[4] = {0};
	char f_unit[4] = {0};
	double offset;
	double duration;
	double freq;

	int rc = sscanf(str, "%*s %lf %3s %lf %3s %lf %3s", &offset, o_unit, &duration, d_unit, &freq, f_unit);

	if (rc != 6) {
		printf("Invalid arguments\n");
		printf("Usage: basic_pulse delay unit duration unit freq unit\n");
		printf("Example: basic_pulse 100 us 250 us 150 MHz\n");
		return;
	}

	uint32_t freq_hz = parse_freq(freq, f_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t duration_ns = parse_time(duration, d_unit);

	if (freq_hz == 0) {
		return;
	}

	char* verif_freq = freq_unit(freq_hz);
	char* verif_t1 = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_t2 = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Basic pulse at %s, offset %s, duration %s\n", verif_freq, verif_t1, verif_t2);

	free(verif_freq);
	free(verif_t1);
	free(verif_t2);

	uint16_t rate = fit_time(duration_ns);

	if (rate == 0)
		return;

	uint16_t element_count = (duration_ns / 4) / rate;

	uint8_t* ram = malloc(4*element_count + 4);

	for (size_t i = 0; i < element_count; i++) {
		ram[4*i + 0] = 0x00;
		ram[4*i + 1] = 0x00;
		ram[4*i + 2] = (ad_default_asf >> 6);
		ram[4*i + 3] = (ad_default_asf << 2) & 0xFF;
	}

	memset(ram + element_count*4, 0, 4);

	seq_entry_t pulse = {
		.fsc = ad_default_fsc,
		.ram_profiles[0] = {
			.start = element_count,
			.end = element_count,
			.rate = 0,
			.mode = AD_RAM_PROFILE_MODE_DIRECTSWITCH
		},
		.ram_profiles[1] = {
			.start = 0,
			.end = element_count,
			.rate = rate,
			.mode = AD_RAM_PROFILE_MODE_RAMPUP
		},
		.ram_image = { .buffer = (uint32_t*)ram, .size = element_count + 1 },
		.ram_destination = AD_RAM_DESTINATION_POLAR,
		.ram_secondary_params = { .ftw =  ad_calc_ftw(freq_hz) },
		.logic_level_sequence = lower_logic_sequence(
			offset_ns ? (logic_t[]){
				{ .hold_ns = offset_ns, .state = 0 },
				{ .hold_ns = duration_ns, .state = PROFILE1 },
				TERMINATOR
			} : (logic_t[]){
				{ .hold_ns = duration_ns, .state = PROFILE1 },
				TERMINATOR
			}
		)
	};

	sequencer_reset();
	sequencer_add(pulse);
	sequencer_run();
}

static void sequencer_add_sweep_internal(const char* str, const char* fstr, const char* caller, int run) {
	char o_unit[4] = {0};
	char d_unit[4] = {0};
	char fc_unit[4] = {0};
	double offset;
	double duration;
	double fc;
	int a;
	int b;

	int rc = sscanf(str, fstr, &offset, o_unit, &duration, d_unit, &fc, fc_unit, &a, &b);

	if (rc != 8) {
		printf("Invalid arguments\n");
		printf("Usage: %s delay unit duration unit center_freq unit a b\n", caller);
		printf("Sweep width is determined by: (duration / 4 ns) * (1 GHz / 2^32) * (a/b)\n");
		printf("When a is positive, sweep goes from fc - width/2 to fc + width/2\n");
		printf("When a is negative, sweep goes from fc + width/2 to fc - width/2\n");
		printf("Example: %s 100 us 250 us 140 MHz 1 1\n", caller);
		return;
	}

	uint32_t fc_hz = parse_freq(fc, fc_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t duration_ns = parse_time(duration, d_unit);

	if (b < 1) {
		printf("Invalid b; must be greater than 0\n");
		return;
	}

	// FIXME: Assuming 1 GHz ad_system_clock
	double fstep = ad_system_clock / ((1ull << 32) + 0.0);
	uint32_t steps = duration_ns / (4 * b);

	if (duration_ns % (4 * b) != 0) {
		printf("Invalid combination of duration and b; duration must be a factor of b * 4 ns\n");
		return;
	}

	double span_hz = a * fstep * (steps - 1);
	double f1_hz = fc_hz - span_hz/2;
	double f2_hz = f1_hz + span_hz;

	char* verif_f1 = freq_unit(f1_hz);
	char* verif_f2 = freq_unit(f2_hz);
	char* verif_fc = freq_unit(fc_hz);
	char* verif_span = freq_unit( ABS(span_hz) );
	char* verif_offset = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Sweep center frequency %s span %s, offset %s, duration %s\n", verif_fc, verif_span, verif_offset, verif_duration);
	printf("f1: %s, f2: %s\n", verif_f1, verif_f2);

	free(verif_f1);
	free(verif_f2);
	free(verif_fc);
	free(verif_span);
	free(verif_offset);
	free(verif_duration);

	uint16_t rate = fit_time(duration_ns);

	if (rate == 0)
		return;

	uint16_t element_count = (duration_ns / 4) / rate;
	uint32_t ftw = ad_calc_ftw(f1_hz);

	// We are using RAM and DRG at the same time and that causes a problem:
	// Even with matched latency enabled, they have different pipeline delays
	// DRG Frequency arrives at the DDS core faster than RAM Phase + Amplitude
	// Thus we get a signal with an unexpected start phase
	// 
	// Datasheet says 12 clocks of delay but through measurements it seems it is actually 20
	// Without compensation:
	// 200 MHz	0 deg start phase
	// 100 MHz	0 deg start phase
	// 50 MHz	0 deg start phase
	// 25 MHz	180 deg start phase => 20 clocks of delay
	//
	// Knowing it's 20 clocks of delay, we can compensate for it
	//
	uint32_t start_phase = ftw * 20;
	uint16_t start_phase_16bit = start_phase >> 16;
	uint16_t compensation = 0xFFFF - start_phase_16bit;

	if (f1_hz > f2_hz) {
		compensation = start_phase_16bit + 0x7FFF;
	}

	printf("Start POW: %d\n", start_phase_16bit);

	uint8_t* ram = malloc(4*element_count + 4);

	for (size_t i = 0; i < element_count; i++) {
		ram[4*i + 0] = compensation >> 8;
		ram[4*i + 1] = compensation & 0xFF;
		ram[4*i + 2] = (ad_default_asf >> 6);
		ram[4*i + 3] = (ad_default_asf << 2) & 0xFF;
	}

